# GroundColor Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewDisplayBackground..::..GroundColor Property
ViewDisplayBackground Class See Also
---
The color of the ground when the type is 'Gradient' or 'SunAndClouds'.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public Color GroundColor { get; }
```

Visual Basic
---
```text
Public ReadOnly Property GroundColor As Color
	Get
```

Visual C++
---
```text
public:
property Color^ GroundColor {
	Color^ get ();
}
```

# See Also
ViewDisplayBackground Class
Autodesk.Revit.DB Namespace